app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
      if @book.save
      redirect_to book_path(@book.id), notice:"You have created book successfully."
      else
       @books = Book.all
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "aaa"], ["body", "aaa"], ["user_id", 1], ["created_at", "2020-11-08 06:32:16.338624"], ["updated_at", "2020-11-08 06:32:16.338624"]]
SELECT "books".* FROM "books"

  def show
    @book = Book.find(params[:id])
    @new_book = Book.new
    @user = User.find(@book.user.id)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]