app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]
---
  def show
    @user = User.find(params[:id])
    @books = @user.books.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "profile_image_id" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", nil], ["introduction", "aaaaaaaaaaaaaaaaaaaaaaaaaaaaa"], ["updated_at", "2020-11-08 07:12:10.410816"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)